window.companydata={
	active: [],
	available:[
	    {
		   	icon: './icon/apple.svg',
		   	name: 'Apple',
		   	shareCode: 'APLE',
		   	priceAtStart: {
		   		usd:"27.34"
		   	},
		   	totalAtStart: {
		   		rur: "18 317.80"
		   	},
		   	numberOfShares:10,
		   	pricesUSD:[
		   	    [2016, 27.34, "", 'wait'],
		   	    [2017, 39.38, "Через несколько дней после старта продаж iPhone X капитализация Apple достигла $900 млрд — впервые в истории. Компания серьёзно вкладывается в исследования и разработки. Одну из новых технологий — Face ID — представили в этом году. Что ещё они придумают? Давайте посмотрим.", 'wait'],
		   	    [2018, 54.4, "Рыночная капитализация Apple достигла $1 трлн. По итогам III финансового квартала показатели стали рекордными за всю историю компании. Был ряд проблем с девайсами, что повлияло на репутацию и продажи. Тем не менее, рекомендуем оставить акции ещё на год.", 'wait'],
		   	    [2019, 51.63, "Акции Apple по итогам 2019 года достигли рекордного роста. Аналитики надеются, что благодаря развитию технологии 5G в следующем году рост продолжится. Прогноз — очень позитивный.", 'wait'],
		   	    [2020, 124.37, "Удачный год: из-за пандемии и работы на удалёнке спрос на компьютеры и технику для дома вырос, у Apple рекордные показатели. Инвесторы настроены оптимистично.", 'wait'],
		   	    [2021, 150.19, "iPhone 12 и 5G понравились миру: финансовые результаты Apple за II квартал 2021 года сильно превзошли ожидания аналитиков. Выручка компании выросла на 36% год к году до рекордных $81,4 млрд.", 'wait']
	   	    ],
		   	sumPricesRUR:[
		   	    [2016,  18317.80],
		   	    [2017,  22849.40],
		   	    [2018,  35904.00],
		   	    [2019,  33559.50],
		   	    [2020,  90790.10],
		   	    [2021, 109638.70]
	   	    ]
	   	},
	    {
		   	icon: './icon/netflix.svg',
		   	name: 'Netflix',
		   	shareCode: 'NFLX',
		   	priceAtStart: {
		   		usd:"95.87"
		   	},
		   	totalAtStart: {
		   		rur: "19 269.87"
		   	},
		   	numberOfShares:3,
		   	pricesUSD:[
	   	      	[2016, 95.87  , "", ""],
	   	      	[2017, 166.54 , "Компания наращивает количество платных подписчиков в США и во всём мире. Netflix много тратит на покупку лицензий и производит оригинальный контент. Чистых конкурентов у видеосервиса пока нет. Давайте посмотрим, что будет в следующем году.", 'wait'],
	   	      	[2018, 316.78 , "Netflix всё более активно вкладывается в уникальный контент, наращивает число подписчиков, выручка неуклонно поднимается. Не помешал даже прошлогодний скандал с Кевином Спейси. Аналитики уверены, что акции будут расти. Рекомендую подождать ещё год.", 'wait'],
	   	      	[2019, 302.8  , "Выручка Netflix продолжает расти. Минусы — растут и долги компании. Инвестиция рискованная, но того стоит: подсчитано, что за десять лет акции видеосервиса показали доходность в 4181%. Возможно, это не предел.", 'wait'],
	   	      	[2020, 492.31 , "Количество активных пользователей Netflix превысило 200 млн — рекордный рост. Конкуренция растёт, но видеосервис остаётся лидером рынка. Сыграла на руку пандемия: все сидели дома и смотрели сериалы. Долговой вопрос решается. Прогноз — позитивный.", 'wait'],
	   	      	[2021, 518.91 , "2021 Рост числа подписчиков Netflix замедляется, конкуренция усиливается, собственного контента из-за пандемии становится меньше. Компания близка к своему максимуму. Однако сервис может удержать доход и найти выход для его роста. Пока лучше занять роль наблюдателя.", 'wait']
	   	    ],
		   	sumPricesRUR:[
		   	    [2016,  19269.87],
		   	    [2017,  28977.96],
		   	    [2018,  62722.44],
		   	    [2019,  59046.00],
		   	    [2020, 107815.89],
		   	    [2021, 113641.29]
	   	    ]
	    }, 					
	    {
		   	icon: './icon/yandex.svg',
		   	name: 'Yandex',
		   	shareCode: 'YNDX',
		   	priceAtStart: {
		   		usd:"22.48"
		   	},
		   	totalAtStart: {
		   		rur: "18 073.92"
		   	},
		   	numberOfShares:12,
		   	pricesUSD:[
	   	      	[2016, 22.48 , "", ""],
	   	      	[2017, 29.81 , "Прибыль «Яндекса»  растёт быстрее выручки. Компания создаёт новые форматы для рекламодателей и выходит на новые рынки. Похоже, рост впереди!", 'sell'],
	   	      	[2018, 31.27 , "Чистая прибыль «Яндекса» составила 45,9 млрд руб. и увеличилась на 430% по сравнению с 2017 годом. Компания укрепила позиции в Поиске, запустила новые сервисы на стыке онлайна и офлайна — Драйв и Еду, обещает экспериментировать дальше.", 'sell'],
	   	      	[2019, 36.48 , "Рост выручки продолжается — теперь на 39%, причём почти четверть приходится на такси и сервисы доставки еды. Самым крупным источником доходов остаётся реклама. Компания активно инвестирует в собственный флот беспилотников — это перспективно.", 'sell'],
	   	      	[2020, 63.57 , "Выручка «Яндекса» за год выросла на 24% по сравнению с 2019 годом и составила 218,3 млрд рублей. В 2021 году «Яндекс» планирует фокусироваться на ускорении темпов роста и инвестициях в развитие сервисов онлайн-торговли.", 'sell'],
	   	      	[2021, 69.07 , "«Яндекс» всё глубже уходит в e-commerce и надеется по итогам года стать лидером по продуктовому обороту в этой сфере. Если учесть, что, по прогнозам аналитиков, рынок электронной коммерции в России к 2024 году достигнет 7,2 трлн рублей, перспективы очень заманчивые.", 'sell'],
	   	    ],
		   	sumPricesRUR:[
		   	    [2016, 18073.92],
		   	    [2017, 20747.76],
		   	    [2018, 24765.84],
		   	    [2019, 28454.40],
		   	    [2020, 55687.32],
		   	    [2021, 60505.32]
	   	    ]
	    },
	    {
	   		icon: './icon/tesla.svg',
	   		name: 'Tesla',
	   		shareCode: 'TSLA',
	   		priceAtStart: {
	   			usd:"45.00"
	   		},
	   		totalAtStart: {
	   			rur: "18 090.00"
	   		},
	   		numberOfShares:6,
	   		pricesUSD:[
	   	    	[2016, 45    , ""],
	   	    	[2017, 69.49 , "В IV квартале компания отчиталась о рекордном убытке, но рынок игнорирует слабую отчётность, а цены акций остаются вблизи максимума. Tesla декларирует амбициозные цели по продажам Model S и Model X и рынок ей верит.", 'sell'],
	   	    	[2018, 61.1  , "Всё непросто, но в IV квартале Tesla увеличила общую выручку на 129% по сравнению с III кварталом 2017 года. Планируется строительство заводов в Китае и в Европе. Думаю, стоит последить за Tesla ещё год.", 'sell'],
	   	    	[2019, 43.99 , "Tesla получает прибыль два квартала подряд — второй раз в истории компании. Фабрика Gigafactory в Шанхае опережает график запуска, на 2021 год запланирован запуск завода в Европе. Инвесторы довольны!", 'sell'],
	   	    	[2020, 410   , "Первый прибыльный год в истории Tesla! Компания готовит обновлённые Model S и X, а в конце года обещает представить долгожданный Cybertruck. В целом за год акции взлетели на 622%. Справится ли Илон Маск с взятым темпом? Имеет смысл подождать и посмотреть.", 'sell'],
	   	    	[2021, 665.71, "Продажи Tesla восстанавливаются после пандемии. Финансовые результаты за II квартал 2021 года значительно превысили ожидания. Компания стала прибыльной восьмой квартал подряд и впервые заработала $1 млрд чистой прибыли за квартал.", 'sell']
	   	    ],
		   	sumPricesRUR:[
		   	    [2016, 18090.00],
		   	    [2017, 24182.52],
		   	    [2018, 24195.60],
		   	    [2019, 17156.10],
		   	    [2020,179580.00],
		   	    [2021,291580.98]
	   	    ]
	    }
	]
}