window.companydata={
	active: [],
	available:[
	    {
		   	icon: './icon/apple.svg',
		   	name: 'Apple',
		   	shareCode: 'APLE',
		   	priceAtStart: {
		   		usd:"26.98"
		   	},
		   	totalAtStart: {
		   		rur: "41 802.10"
		   	},
		   	numberOfShares:24,
		   	pricesUSD:[
		   	    [2016,  26.98, "", 'wait'],
		   	    [2017,  39.91, "Через несколько дней после старта продаж iPhone X капитализация Apple достигла $900 млрд — впервые в истории. Компания серьёзно вкладывается в исследования и разработки. Одну из новых технологий — Face ID — представили в этом году. Что ещё они придумают? Давайте посмотрим.", 'wait'],
		   	    [2018,  56.60, "Рыночная капитализация Apple достигла $1 трлн. По итогам III финансового квартала показатели стали рекордными за всю историю компании. Был ряд проблем с девайсами, что повлияло на репутацию и продажи. Тем не менее, рекомендуем оставить акции ещё на год.", 'wait'],
		   	    [2019,  54.68, "Акции Apple по итогам 2019 года достигли рекордного роста. Аналитики надеются, что благодаря развитию технологии 5G в следующем году рост продолжится. Прогноз — очень позитивный.", 'wait'],
		   	    [2020, 115.35, "Удачный год: из-за пандемии и работы на удалёнке спрос на компьютеры и технику для дома вырос, у Apple рекордные показатели. Инвесторы настроены оптимистично.", 'wait'],
		   	    [2021, 148.97, "iPhone 12 и 5G понравились миру: финансовые результаты Apple за II квартал 2021 года сильно превзошли ожидания аналитиков. Выручка компании выросла на 36% год к году до рекордных $81,4 млрд.", 'wait']
	   	    ],
		   	sumPricesRUR:[
		   	    [2016,  41802.10],
		   	    [2017,  55310.20],
		   	    [2018,  91917.60],
		   	    [2019,  85246.60],
		   	    [2020, 209645.40],
		   	    [2021, 261257.50]
	   	    ]
	   	},
	    {
		   	icon: './icon/netflix.svg',
		   	name: 'Netflix',
		   	shareCode: 'NFLX',
		   	priceAtStart: {
		   		usd:"97.17"
		   	},
		   	totalAtStart: {
		   		rur: "37 638.40"
		   	},
		   	numberOfShares:6,
		   	pricesUSD:[
	   	      	[2016,  97.17  , "", ""],
	   	      	[2017, 183.64 , "Компания наращивает количество платных подписчиков в США и во всём мире. Netflix много тратит на покупку лицензий и производит оригинальный контент. Чистых конкурентов у видеосервиса пока нет. Давайте посмотрим, что будет в следующем году.", 'wait'],
	   	      	[2018, 368.15 , "Netflix всё более активно вкладывается в уникальный контент, наращивает число подписчиков, выручка неуклонно поднимается. Не помешал даже прошлогодний скандал с Кевином Спейси. Аналитики уверены, что акции будут расти. Рекомендую подождать ещё год.", 'wait'],
	   	      	[2019, 294.15  , "Выручка Netflix продолжает расти. Минусы — растут и долги компании. Инвестиция рискованная, но того стоит: подсчитано, что за десять лет акции видеосервиса показали доходность в 4181%. Возможно, это не предел.", 'wait'],
	   	      	[2020, 476.26 , "Количество активных пользователей Netflix превысило 200 млн — рекордный рост. Конкуренция растёт, но видеосервис остаётся лидером рынка. Сыграла на руку пандемия: все сидели дома и смотрели сериалы. Долговой вопрос решается. Прогноз — позитивный.", 'wait'],
	   	      	[2021, 598.72 , "2021 Рост числа подписчиков Netflix замедляется, конкуренция усиливается, собственного контента из-за пандемии становится меньше. Компания близка к своему максимуму. Однако сервис может удержать доход и найти выход для его роста. Пока лучше занять роль наблюдателя.", 'wait']
	   	    ],
		   	sumPricesRUR:[
		   	    [2016,  37638.40],
		   	    [2017,  63625.40],
		   	    [2018, 149467.65],
		   	    [2019, 114645.60],
		   	    [2020, 216397.30],
		   	    [2021, 262502.70]
	   	    ]
	    }, 					
	    {
		   	icon: './icon/yandex.svg',
		   	name: 'Yandex',
		   	shareCode: 'YNDX',
		   	priceAtStart: {
		   		usd:"20.38"
		   	},
		   	totalAtStart: {
		   		rur: "42 101.60"
		   	},
		   	numberOfShares:32,
		   	pricesUSD:[
	   	      	[2016, 20.38 , "", ""],
	   	      	[2017, 32.44 , "Прибыль «Яндекса»  растёт быстрее выручки. Компания создаёт новые форматы для рекламодателей и выходит на новые рынки. Похоже, рост впереди!", 'sell'],
	   	      	[2018, 31.34 , "Чистая прибыль «Яндекса» составила 45,9 млрд руб. и увеличилась на 430% по сравнению с 2017 годом. Компания укрепила позиции в Поиске, запустила новые сервисы на стыке онлайна и офлайна — Драйв и Еду, обещает экспериментировать дальше.", 'sell'],
	   	      	[2019, 37.88 , "Рост выручки продолжается — теперь на 39%, причём почти четверть приходится на такси и сервисы доставки еды. Самым крупным источником доходов остаётся реклама. Компания активно инвестирует в собственный флот беспилотников — это перспективно.", 'sell'],
	   	      	[2020, 62.58 , "Выручка «Яндекса» за год выросла на 24% по сравнению с 2019 годом и составила 218,3 млрд рублей. В 2021 году «Яндекс» планирует фокусироваться на ускорении темпов роста и инвестициях в развитие сервисов онлайн-торговли.", 'sell'],
	   	      	[2021, 80.12 , "«Яндекс» всё глубже уходит в e-commerce и надеется по итогам года стать лидером по продуктовому обороту в этой сфере. Если учесть, что, по прогнозам аналитиков, рынок электронной коммерции в России к 2024 году достигнет 7,2 трлн рублей, перспективы очень заманчивые.", 'sell'],
	   	    ],
		   	sumPricesRUR:[
		   	    [2016,  42101.60],
		   	    [2017,  59943.60],
		   	    [2018,  67861.00],
		   	    [2019,  78740.30],
		   	    [2020, 151649.90],
		   	    [2021, 187348.25]
	   	    ]
	    },
	    {
	   		icon: './icon/tesla.svg',
	   		name: 'Tesla',
	   		shareCode: 'TSLA',
	   		priceAtStart: {
	   			usd:"39.21"
	   		},
	   		totalAtStart: {
	   			rur: "40 500.60"
	   		},
	   		numberOfShares:16,
	   		pricesUSD:[
	   	    	[2016, 39.21 , ""],
	   	    	[2017, 73.24 , "В IV квартале компания отчиталась о рекордном убытке, но рынок игнорирует слабую отчётность, а цены акций остаются вблизи максимума. Tesla декларирует амбициозные цели по продажам Model S и Model X и рынок ей верит.", 'sell'],
	   	    	[2018, 57.89 , "Всё непросто, но в IV квартале Tesla увеличила общую выручку на 129% по сравнению с III кварталом 2017 года. Планируется строительство заводов в Китае и в Европе. Думаю, стоит последить за Tesla ещё год.", 'sell'],
	   	    	[2019, 49.04 , "Tesla получает прибыль два квартала подряд — второй раз в истории компании. Фабрика Gigafactory в Шанхае опережает график запуска, на 2021 год запланирован запуск завода в Европе. Инвесторы довольны!", 'sell'],
	   	    	[2020, 419.62, "Первый прибыльный год в истории Tesla! Компания готовит обновлённые Model S и X, а в конце года обещает представить долгожданный Cybertruck. В целом за год акции взлетели на 622%. Справится ли Илон Маск с взятым темпом? Имеет смысл подождать и посмотреть.", 'sell'],
	   	    	[2021, 736.27, "Продажи Tesla восстанавливаются после пандемии. Финансовые результаты за II квартал 2021 года значительно превысили ожидания. Компания стала прибыльной восьмой квартал подряд и впервые заработала $1 млрд чистой прибыли за квартал.", 'sell']
	   	    ],
		   	sumPricesRUR:[
		   	    [2016, 40500.60],
		   	    [2017, 67667.55],
		   	    [2018, 62675.10],
		   	    [2019, 50969.20],
		   	    [2020,508431.75],
		   	    [2021,860826.90]
	   	    ]
	    }
	]
}